СправочникиИДокументы_практика/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Пример</name>
    <type>
      <types>Boolean</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <types>Date</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СправочникиИДокументы_практика/src/Documents/ПоступлениеТоваров/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Контрагент.Префикс;
КонецПроцедуры

Процедура ПрименитьСкидкуКДокументу (Процент) Экспорт
	
	Если ТипЗнч(Процент) <> Тип("Число") Или Процент < 0 Или Процент > 100 Тогда
		ВызватьИсключение "Не корректный процент";
	КонецЕсли;
	
	Коэффициент = 1 - (Процент/100);
	
	Для Каждого Строка Из ТабличнаяЧасть1 Цикл 
		Строка.Цена = Строка.Цена * Коэффициент;
		Строка.Сумма = Строка.Цена * Строка.Количество;
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
КонецПроцедуры     

Процедура РассчитатьСуммуДокумента()
	СуммаДокумента = ТабличнаяЧасть1.Итог("Сумма");
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РассчитатьСуммуДокумента();

КонецПроцедуры
